CRUD-general-purpose/2024/ranking-ycsb_11-2024_mongodb-ce-800-medium-medium-msazure_0_Gt6MK4rd/0_load.txt
bin/ycsb load mongodb -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p mongodb.url=mongodb://benchant:Performance99@10.10.0.24:27017,10.10.0.21:27017,10.10.0.23:27017/admin -p batchsize=10 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0  -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 
/usr/lib/jvm/java-1.8.0-openjdk-amd64/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/mongodb-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/binary/ycsb/mongodb-binding/lib/bson-5.1.3.jar:/binary/ycsb/mongodb-binding/lib/mongodb-binding-0.18.0-SNAPSHOT.jar:/binary/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/binary/ycsb/mongodb-binding/lib/mongodb-driver-sync-5.1.3.jar:/binary/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/mongodb-driver-core-5.1.3.jar:/binary/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/mongodb-binding/lib/bson-record-codec-5.1.3.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://benchant:Performance99@10.10.0.24:27017,10.10.0.21:27017,10.10.0.23:27017/admin -p batchsize=10 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -load
Command line: -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://benchant:Performance99@10.10.0.24:27017,10.10.0.21:27017,10.10.0.23:27017/admin -p batchsize=10 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2024-11-21 13:42:30:770 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://benchant:Performance99@10.10.0.24:27017,10.10.0.21:27017,10.10.0.23:27017/admin
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-11-21 13:42:40:723 10 sec: 219010 operations; 21901 current ops/sec; est completion in 3 minutes [INSERT: Count=219010, Max=699391, Min=1, Avg=4388.05, 90=17071, 99=60895, 99.9=110207, 99.99=599551] 
2024-11-21 13:42:50:722 20 sec: 438100 operations; 21909 current ops/sec; est completion in 3 minutes [INSERT: Count=219090, Max=462591, Min=1, Avg=4544.39, 90=907, 99=62911, 99.9=250111, 99.99=457215] 
2024-11-21 13:43:00:722 30 sec: 474330 operations; 3623 current ops/sec; est completion in 4 minutes [INSERT: Count=36230, Max=3375103, Min=1, Avg=27742.1, 90=581, 99=407295, 99.9=3371007, 99.99=3373055] 
2024-11-21 13:43:10:722 40 sec: 685590 operations; 21126 current ops/sec; est completion in 4 minutes [INSERT: Count=211260, Max=467455, Min=1, Avg=4733.92, 90=8647, 99=65215, 99.9=225407, 99.99=457727] 
2024-11-21 13:43:20:722 50 sec: 880750 operations; 19516 current ops/sec; est completion in 3 minutes [INSERT: Count=195160, Max=261503, Min=1, Avg=5103.27, 90=1071, 99=79679, 99.9=234879, 99.99=250751] 
2024-11-21 13:43:30:722 60 sec: 1126340 operations; 24559 current ops/sec; est completion in 3 minutes [INSERT: Count=245590, Max=85247, Min=1, Avg=4085.26, 90=1194, 99=59743, 99.9=77247, 99.99=83583] 
2024-11-21 13:43:40:722 70 sec: 1319970 operations; 19363 current ops/sec; est completion in 3 minutes [INSERT: Count=193630, Max=547327, Min=1, Avg=4506.61, 90=559, 99=61919, 99.9=187007, 99.99=545791] 
2024-11-21 13:43:50:722 80 sec: 1321970 operations; 200 current ops/sec; est completion in 3 minutes [INSERT: Count=2000, Max=5844991, Min=1, Avg=433790.86, 90=30, 99=4497407, 99.9=4501503, 99.99=5844991] 
2024-11-21 13:44:00:722 90 sec: 1440540 operations; 11857 current ops/sec; est completion in 3 minutes [INSERT: Count=118570, Max=3403775, Min=1, Avg=10237.55, 90=642, 99=128639, 99.9=1851391, 99.99=3397631] 
2024-11-21 13:44:10:722 100 sec: 1647500 operations; 20696 current ops/sec; est completion in 3 minutes [INSERT: Count=207000, Max=1209343, Min=1, Avg=5050.69, 90=731, 99=56799, 99.9=231423, 99.99=1208319] 
2024-11-21 13:44:20:722 110 sec: 1878970 operations; 23147 current ops/sec; est completion in 3 minutes [INSERT: Count=231430, Max=123839, Min=1, Avg=4312.35, 90=592, 99=64415, 99.9=111871, 99.99=120127] 
2024-11-21 13:44:30:722 120 sec: 1995580 operations; 11661 current ops/sec; est completion in 3 minutes [INSERT: Count=116610, Max=376575, Min=1, Avg=5542.04, 90=792, 99=85055, 99.9=208383, 99.99=362239] 
2024-11-21 13:44:40:722 130 sec: 2183180 operations; 18760 current ops/sec; est completion in 2 minutes [INSERT: Count=187600, Max=5177343, Min=1, Avg=7194.64, 90=960, 99=61503, 99.9=732159, 99.99=5177343] 
2024-11-21 13:44:50:722 140 sec: 2400540 operations; 21736 current ops/sec; est completion in 2 minutes [INSERT: Count=217369, Max=160895, Min=1, Avg=4584.35, 90=18767, 99=72703, 99.9=120831, 99.99=156287] 
2024-11-21 13:45:00:722 150 sec: 2605170 operations; 20463 current ops/sec; est completion in 2 minutes [INSERT: Count=204669, Max=184063, Min=1, Avg=4918.88, 90=940, 99=77055, 99.9=128063, 99.99=175999] 
2024-11-21 13:45:10:722 160 sec: 2624790 operations; 1962 current ops/sec; est completion in 2 minutes [INSERT: Count=19572, Max=2983935, Min=1, Avg=37896.66, 90=136, 99=649215, 99.9=2977791, 99.99=2983935] 
2024-11-21 13:45:20:722 170 sec: 2813080 operations; 18829 current ops/sec; est completion in 2 minutes [INSERT: Count=188290, Max=5111807, Min=1, Avg=6675.95, 90=715, 99=71935, 99.9=356351, 99.99=3508223] 
2024-11-21 13:45:30:722 180 sec: 3041610 operations; 22853 current ops/sec; est completion in 1 minute [INSERT: Count=228530, Max=123647, Min=1, Avg=4369.29, 90=555, 99=68799, 99.9=98751, 99.99=121535] 
2024-11-21 13:45:40:722 190 sec: 3285350 operations; 24374 current ops/sec; est completion in 1 minute [INSERT: Count=243740, Max=225919, Min=1, Avg=4108.1, 90=969, 99=58559, 99.9=78719, 99.99=208511] 
2024-11-21 13:45:50:722 200 sec: 3396300 operations; 11095 current ops/sec; est completion in 1 minute [INSERT: Count=110950, Max=2691071, Min=1, Avg=7460.81, 90=396, 99=98239, 99.9=1338367, 99.99=2678783] 
2024-11-21 13:46:00:722 210 sec: 3487110 operations; 9081 current ops/sec; est completion in 1 minute [INSERT: Count=90810, Max=3600383, Min=1, Avg=12870.37, 90=308, 99=60255, 99.9=2576383, 99.99=3594239] 
2024-11-21 13:46:10:722 220 sec: 3727810 operations; 24070 current ops/sec; est completion in 1 minute [INSERT: Count=240700, Max=225407, Min=1, Avg=4160.66, 90=937, 99=60415, 99.9=111807, 99.99=217215] 
2024-11-21 13:46:20:722 230 sec: 3792050 operations; 6424 current ops/sec; est completion in 1 minute [INSERT: Count=64240, Max=2433023, Min=1, Avg=15497.62, 90=377, 99=163455, 99.9=2420735, 99.99=2426879] 
2024-11-21 13:46:30:722 240 sec: 4000240 operations; 20819 current ops/sec; est completion in 1 minute [INSERT: Count=208190, Max=375807, Min=1, Avg=4450.19, 90=913, 99=62975, 99.9=129599, 99.99=367103] 
2024-11-21 13:46:40:722 250 sec: 4149680 operations; 14944 current ops/sec; est completion in 52 seconds [INSERT: Count=149440, Max=1261567, Min=1, Avg=7195.66, 90=443, 99=79423, 99.9=964607, 99.99=1259519] 
2024-11-21 13:46:50:722 260 sec: 4395453 operations; 24577.3 current ops/sec; est completion in 36 seconds [INSERT: Count=245850, Max=138111, Min=1, Avg=4077.66, 90=926, 99=58079, 99.9=101631, 99.99=122239] 
2024-11-21 13:47:00:722 270 sec: 4623640 operations; 22818.7 current ops/sec; est completion in 22 seconds [INSERT: Count=228110, Max=132991, Min=1, Avg=4356.99, 90=608, 99=64831, 99.9=113279, 99.99=126399] 
2024-11-21 13:47:10:722 280 sec: 4730960 operations; 10732 current ops/sec; est completion in 16 seconds [INSERT: Count=107320, Max=1314815, Min=1, Avg=8274.02, 90=802, 99=111487, 99.9=1082367, 99.99=1301503] 
2024-11-21 13:47:20:722 290 sec: 4760950 operations; 2999 current ops/sec; est completion in 15 seconds [INSERT: Count=29990, Max=4354047, Min=1, Avg=34894.61, 90=1429, 99=482303, 99.9=3516415, 99.99=4354047] 
2024-11-21 13:47:30:722 300 sec: 4994906 operations; 23395.6 current ops/sec; est completion in 1 second [CLEANUP: Count=36, Max=9, Min=0, Avg=1.44, 90=2, 99=9, 99.9=9, 99.99=9] [INSERT: Count=233956, Max=990719, Min=1, Avg=4545.67, 90=19391, 99=55007, 99.9=193023, 99.99=980991] 
2024-11-21 13:47:31:286 300 sec: 5000000 operations; 9031.91 current ops/sec; [CLEANUP: Count=64, Max=8487, Min=0, Avg=133.7, 90=2, 99=6, 99.9=8487, 99.99=8487] [INSERT: Count=5094, Max=41535, Min=1, Avg=2700.04, 90=18895, 99=38527, 99.9=41375, 99.99=41503] 
[OVERALL], RunTime(ms), 300564
[OVERALL], Throughput(ops/sec), 16635.392129463275
[TOTAL_GCS_PS_Scavenge], Count, 10
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 67
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.022291425453480788
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 10
[TOTAL_GC_TIME], Time(ms), 67
[TOTAL_GC_TIME_%], Time(%), 0.022291425453480788
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 86.09
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 8487
[CLEANUP], 50thPercentileLatency(us), 1
[CLEANUP], 90thPercentileLatency(us), 2
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 9
[CLEANUP], 99.99PercentileLatency(us), 8487
[CLEANUP], 99.99999PercentileLatency(us), 8487
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 5991.9707338
[INSERT], MinLatency(us), 1
[INSERT], MaxLatency(us), 5844991
[INSERT], 50thPercentileLatency(us), 2
[INSERT], 90thPercentileLatency(us), 17087
[INSERT], 95thPercentileLatency(us), 38911
[INSERT], 99thPercentileLatency(us), 69119
[INSERT], 99.99PercentileLatency(us), 3397631
[INSERT], 99.99999PercentileLatency(us), 5844991
[INSERT], Return=OK, 500000
[INSERT], Return=BATCHED_OK, 4500000